# Dataframe

In [1]:
import pandas as pd

In [ ]:
dados = {
    'Nome': ['Aline', 'Bob', 'Charlie'],
    'Idade': [24,30,22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [5]:
df = pd.DataFrame(dados)
df

      Nome  Idade          Cidade
0    Aline     24       São Paulo
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [7]:
df.head(1)

    Nome  Idade     Cidade
0  Aline     24  São Paulo

In [ ]:
df.tail(1) # traz últtima linha

      Nome  Idade          Cidade
2  Charlie     22  Belo Horizonte

In [9]:
dados_notas = {
    'Nome':['Aline', 'Bob', 'Charlie', 'David', 'Eva' ],
    'Matematica':[85,90,78,88,92],
    'Fisica': [80,75,88,85,95],
    'Química': [78,82,85,80,88]
    }

In [11]:
df_notas = pd.DataFrame(dados_notas)
df_notas

      Nome  Matematica  Fisica  Química
0    Aline          85      80       78
1      Bob          90      75       82
2  Charlie          78      88       85
3    David          88      85       80
4      Eva          92      95       88

In [14]:
# Calculando a média das notas
df_notas['Media'] = df_notas[['Matematica', 'Fisica', 'Química']].mean(axis=1).round(2)
df_notas

      Nome  Matematica  Fisica  Química  Media
0    Aline          85      80       78  81.00
1      Bob          90      75       82  82.33
2  Charlie          78      88       85  83.67
3    David          88      85       80  84.33
4      Eva          92      95       88  91.67

In [16]:
# Identificar alunos aprovados com nota boa (média >= 82.5)
alunos_aprovados = df_notas[df_notas['Media']>=82.5]
alunos_aprovados

      Nome  Matematica  Fisica  Química  Media
2  Charlie          78      88       85  83.67
3    David          88      85       80  84.33
4      Eva          92      95       88  91.67

In [17]:
# Exibir a média e os alunos aprovados

df_notas[['Nome', 'Media']]

      Nome  Media
0    Aline  81.00
1      Bob  82.33
2  Charlie  83.67
3    David  84.33
4      Eva  91.67

In [20]:
alunos_aprovados[['Nome', 'Media']]

      Nome  Media
2  Charlie  83.67
3    David  84.33
4      Eva  91.67